#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/DevopsFiapSoat3-G35/postech-fase-3-db/runs/run-1q9zXDigF7sEw8DF

Waiting for the plan to start...

Terraform v1.7.4
on linux_amd64
Initializing plugins and modules...
data.aws_availability_zones.available: Refreshing...
aws_db_parameter_group.education: Refreshing state... [id=education]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-014d09ca3e3f0f8fb]
aws_security_group.rds: Refreshing state... [id=sg-0192f54a035755f56]
data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-1]
aws_db_instance.education: Refreshing state... [id=education]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0b21768ebc88e32d2]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-02d61e135f98e213c]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-01f06981c1b1dcc67]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-02df9eb2ec77f5a1a]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00487c33de206022a]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00487c33de206022a1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ab53d823523c0ed0]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-038b6194c317f89b0]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fd922c272a90fd1c]
aws_db_subnet_group.education: Refreshing state... [id=education]
aws_db_instance.education: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "POSTGRES_USER_PASSWORD"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-1q9zXDigF7sEw8DF/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_instance.education will be updated in-place
  ~ resource "aws_db_instance" "education" {
        id                                    = "education"
        tags                                  = {}
      ~ vpc_security_group_ids                = [
          - "sg-0192f54a035755f56",
        ] -> (known after apply)
        # (42 unchanged attributes hidden)
    }

  # aws_security_group.rds must be replaced
-/+ resource "aws_security_group" "rds" {
      ~ arn                    = "arn:aws:ec2:us-east-1:471112887467:security-group/sg-0192f54a035755f56" -> (known after apply)
      ~ id                     = "sg-0192f54a035755f56" -> (known after apply)
        name                   = "education_rds"
      + name_prefix            = (known after apply)
      ~ owner_id               = "471112887467" -> (known after apply)
        tags                   = {
            "Name" = "education_rds"
        }
      ~ vpc_id                 = "vpc-014d09ca3e3f0f8fb" -> "education" # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @alinedonatoc, Action: `pull_request`*